'''
Список чисел
На вход программе подается одно число nn. Напишите программу, которая выводит список [1, 2, 3, ..., n].

Формат входных данных
На вход программе подается одно натуральное число.
'''

n = int(input())
print(list(range(1, n + 1)))
