'''В данном задании вам необходимо найти и вывести сумму и разность двух чисел через пробел.

Формат входных данных: два числа, каждое на отдельной строке

Формат выходных данных: два числа через пробел

Sample Input:
10
5
Sample Output:
15 5
'''
a = int(input())
b = int(input())
print(a + b, a - b)
