'''
Площадь треугольника
Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.
'''
a = float(input())
b = float(input())
s = 0.5 * a * b
print(s)
