'''
Подвиг 1. Напишите программу ввода строки и отображения на экране ее первого и последнего символа в виде одной строки.
'''

s = input()

print(s[0] + s[-1])
