'''Подвиг 4. Напишите программу отображения первых четырех символов из введенной строки. Будем полагать, что строка гарантированно длиной не менее четырех символов.'''

s = input()
print(s[:4])
