'''
Подвиг 5. Напишите программу отображения последних трех символов из введенной строки. Будем полагать, что строка гарантированно длиной не менее трех символов.
'''

s = input()
print(s[-3:])
