'''
Подвиг 6. Напишите программу отображения всех символов с нечетными индексами из введенной строки.
'''

s = input()
print(s[1::2])
