'''
Подвиг 1. В программе определите три следующие переменные:

a = 7
b = -4
c = 3
Выведите в консоль их значения, используя одну функцию print (между значениями переменных должен стоять один пробел).
'''

a = 7
b = -4
c = 3

print(a, b, c)
