'''
Подвиг 11. Напишите программу вывода переменной math.pi с точностью до тысячных (три знака после запятой).
'''
import math
print(round(math.pi, 3))