'''Подвиг 2. В программе определите три следующие переменные:

a = 7
b = -4
c = 3
Выведите в консоль их значения в столбик (каждое новое значение отображается с новой строчки), используя одну функцию print.
'''

a = 7
b = -4
c = 3
print(a)
print(b)
print(c)
