'''
Подвиг 5. Напишите программу, в которой вводятся два целых положительных числа и в консоль выводится результат возведения первого числа в степень второго.
'''

a, b = map(int, input().split())

print(a**b)