'''
Подвиг 8. Напишите программу, которая принимает на вход два вещественных числа в одну строку через пробел и выводит на экран их сумму.
'''

a, b = map(float, input().split())
print(a + b)
