'''
Звездный прямоугольник
Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

Примечание. Высота и ширина прямоугольника равны 44 и 1717 звёздочкам соответственно.
'''

print('*' * 17)
print('*', ' ' * 15, '*', sep='')
print('*', ' ' * 15, '*', sep='')
print('*' * 17)
