/*
Задание
Вывести информацию о книгах (название книги, фамилию и инициалы автора, название жанра, цену и количество экземпляров книги), написанных в самых популярных жанрах, в отсортированном в алфавитном порядке по названию книг виде. Самым популярным считать жанр, общее количество экземпляров книг которого на складе максимально.

Результат
+-----------------------+------------------+------------+--------+--------+
| title                 | name_author      | name_genre | price  | amount |
+-----------------------+------------------+------------+--------+--------+
| Белая гвардия         | Булгаков М.А.    | Роман      | 540.50 | 5      |
| Братья Карамазовы     | Достоевский Ф.М. | Роман      | 799.01 | 3      |
| Игрок                 | Достоевский Ф.М. | Роман      | 480.50 | 10     |
| Идиот                 | Достоевский Ф.М. | Роман      | 460.00 | 10     |
| Лирика                | Пастернак Б.Л.   | Поэзия     | 518.99 | 10     |
| Мастер и Маргарита    | Булгаков М.А.    | Роман      | 670.99 | 3      |
| Стихотворения и поэмы | Есенин С.А.      | Поэзия     | 650.00 | 15     |
| Черный человек        | Есенин С.А.      | Поэзия     | 570.20 | 6      |
+-----------------------+------------------+------------+--------+--------+
Структура и наполнение таблиц
Таблица genre:
+----------+-------------+
| genre_id | name_genre  |
+----------+-------------+
| 1        | Роман       |
| 2        | Поэзия      |
| 3        | Приключения |
+----------+-------------+

Таблица author:
+-----------+------------------+
| author_id | name_author      |
+-----------+------------------+
| 1         | Булгаков М.А.    |
| 2         | Достоевский Ф.М. |
| 3         | Есенин С.А.      |
| 4         | Пастернак Б.Л.   |
| 5         | Лермонтов М.Ю.   |
+-----------+------------------+

Таблица book:
+---------+-----------------------+-----------+----------+--------+--------+
| book_id | title                 | author_id | genre_id | price  | amount |
+---------+-----------------------+-----------+----------+--------+--------+
| 1       | Мастер и Маргарита    | 1         | 1        | 670.99 | 3      |
| 2       | Белая гвардия         | 1         | 1        | 540.50 | 5      |
| 3       | Братья Карамазовы     | 2         | 1        | 799.01 | 3      |
| 4       | Игрок                 | 2         | 1        | 480.50 | 10     |
| 5       | Стихотворения и поэмы | 3         | 2        | 650.00 | 15     |
| 6       | Черный человек        | 3         | 2        | 570.20 | 6      |
| 7       | Лирика                | 4         | 2        | 518.99 | 10     |
| 8       | Идиот                 | 2         | 1        | 460.00 | 10     |
| 9       | Герой нашего времени  | 5         | 3        | 570.59 | 2      |
| 10      | Доктор Живаго         | 4         | 3        | 740.50 | 5      |
+---------+-----------------------+-----------+----------+--------+--------+

*/

SELECT title, name_author, name_genre, price, amount
FROM book
    INNER JOIN genre ON genre.genre_id=book.genre_id
    INNER JOIN author ON author.author_id=book.author_id
WHERE
    book.genre_id IN (
    SELECT query_in_1.genre_id
    FROM
    (/*получаем коды жанра и количество произведений*/
    SELECT genre_id, SUM(amount) AS sum_amount
    FROM book
    GROUP BY genre_id
    ) query_in_1
    INNER JOIN
    (/*получаем максимальное число книг в жанре*/
    SELECT genre_id, SUM(amount) AS sum_amount
    FROM book
    GROUP BY genre_id
    ORDER BY sum_amount DESC
    LIMIT 1
    ) query_in_2
    ON query_in_1.sum_amount = query_in_2.sum_amount
    )
ORDER BY title

