'''
Привет, мир! 2.0
  Примените ваши приобретенные навыки работы со строками, чтобы написать программу, которая при запуске выводит два сообщения, каждое с новой строки: "Привет мир!" и "Hello world!" в таком порядке, но без кавычек.
'''
print("Привет мир!")
print("Hello world!")
