'''
Обращение по имени
  Завершите задание для заказчика так, чтобы пользователь, введя свое имя, получал от программы сообщение с приветствием. Пользователь может ввести произвольную строку.

        Формат ввода: вводится одна произвольная строка - имя пользователя.

        Формат вывода: приветствие программы согласно примерам ниже. Программа должна использовать то же имя, которое было введено с клавиатуры.

  Важно: формат сообщения должен соответствовать шаблону, предоставленному в примере.
'''

s = input()
print("Здравствуй,", s)
