b = int(input())
q = int(input())
n = int(input())

print(b * q ** (n - 1))
#####################################################################################
n = int(input())
print(n // 100)

#####################################################################################
n = int(input())
k = int(input())
print(k // n)
print(k % n)

#####################################################################################
n = int(input())
print((n + 1) // 2)

#####################################################################################

n = int(input())
print((-n // 4) * (-1))

#####################################################################################

m = int(input())
a = m // 60
b = m % 60
print(f"{m} мин - это {a} час {b} минут.")

#####################################################################################
n = int(input())
digit3 = n % 10
digit2 = (n % 100) // 10
digit1 = (n % 1000) // 100
sm = digit1 + digit2 + digit3
mul = digit1 * digit2 * digit3
print(f"Сумма цифр = {sm}")
print(f"Произведение цифр = {mul}")

#####################################################################################
n = int(input())
c = n % 10
b = (n % 100) // 10
a = (n % 1000) // 100
print(f"{a}{b}{c}")
print(f"{a}{c}{b}")
print(f"{b}{a}{c}")
print(f"{b}{c}{a}")
print(f"{c}{a}{b}")
print(f"{c}{b}{a}")

#####################################################################################
n = int(input())
digit4 = n % 10
digit3 = (n % 100) // 10
digit2 = (n % 1000) // 100
digit1 = (n % 10000) // 1000
print(f"Цифра в позиции тысяч равна {digit1}")
print(f"Цифра в позиции сотен равна {digit2}")
print(f"Цифра в позиции десятков равна {digit3}")
print(f"Цифра в позиции единиц равна {digit4}")
