"""
Животные: создайте список из трех (и более) животных, обладающих общей характе-
ристикой. Используйте цикл for для вывода названий всех животных.
•	 Измените программу так, чтобы вместо простого названия выводилось сообщение,
включающее это название, например «A dog would make a great pet».
•	 Добавьте в конец программы строку с описанием общего свойства. Например, можно
вывести сообщение «Any of these animals would make a great pet!».
"""

animal = ["жираф", "тигр", "леопард", "медведь"]
for i in animal:
    print(i, "- большое животное")

print("Любые эти животные большие")
