'''
Чет-нечет
  Напишите программу, которая выводит "Чет", если введенное целое число является четным, и "Нечет" в обратном случае. ﻿
'''

n = int(input())
if n % 2 == 0:
    print("Чет")
else:
    print("Нечет")
