"""
Любимые числа: используйте словарь для хранения любимых чисел. Возьмите пять
имен и используйте их как ключи словаря. Придумайте любимое число для каждого чело-
века и сохраните его как значение в словаре. Выведите имя каждого человека и его люби-
мое число. Чтобы задача стала более интересной, опросите нескольких друзей и соберите
реальные данные для своей программы.
"""
numbers = {
    "Alex": 5,
    "John": 7,
    "Leonard": 9,
    "Sheldon": 3,
    "Mari": 1
}
print("Любимое число Alex", "-", numbers["Alex"])
print("Любимое число John", "-", numbers["John"])
print("Любимое число Leonard", "-", numbers["Leonard"])
print("Любимое число Sheldon", "-", numbers["Sheldon"])
print("Любимое число Mari", "-", numbers["Mari"])
