'''
Код Морзе
Код Морзе для представления цифр и букв использует тире и точки.
'''

letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---',
         '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---',
         '...--', '....-', '.....', '-....', '--...', '---..', '----.']

d = dict(zip(letters, morse))
input_text = input().upper()

for c in input_text:
    if c in d:
        print(d[c], end=' ')


