'''
Принадлежность 1
Напишите программу, которая принимает целое число xx и определяет, принадлежит ли данное число указанному промежутку.
от -1 до 17
'''

x = int(input())
if -1 < x < 17:
    print('Принадлежит')
else:
    print('Не принадлежит')
