'''
Подвиг 5. Напишите программу ввода двух строк (каждая вводится с новой строки) и их объединения в одну строку через пробел. Результат выведите на экран.
'''

s1 = input()
s2 = input()
print(s1, s2)