'''
2. Сложение чисел
  Напишите программу, которая принимает на вход два целых числа и выводит их сумму.
'''

n1 = int(input())
n2 = int(input())
print(n1 + n2)
