'''
  12. Простое сравнение
  Операторы сравнения часто применяются в связке с условными конструкциями, однако уже сейчас вы можете практиковаться в их использовании. На вход программе подаются две строки. Выведите True, если они НЕ равны и False в обратном случае.
'''

s1 = input()
s2 = input()
print(s1 != s2)
