'''
3. Площадь прямоугольника  
  Напишите программу, вычисляющую площадь произвольного прямоугольника из двух введенных чисел — длин его сторон.

  Формат ввода: два числа (возможно, дробных) на отдельных строках.

  Формат вывода: число (возможно, дробное) — площадь прямоугольника.
'''

l1 = float(input())
l2 = float(input())
print(l1 * l2)
