'''
4. Перевод в метры
  Напишите программу, переводящую введенное количество сантиметров в метры.

  Формат ввода: число (возможно, дробное).

  Формат вывода: число (возможно, дробное) — результат перевода.
'''

length = float(input())
print(length / 100)
